{
    "file_name": "Lakshay Gupta.pdf",
    "file_id": "2910afcd-c6a1-4a45-bf7c-170a85314950",
    "raw_text": "LAKSHAY GUPTA\nDelhi /India | 9772914979 |lakshayanil165@gmail.com\nLinkedIn | GitHub\nABOUT\nBackend developer with experience in building scalable RESTful APIs using FastAPI, MongoDB, and Dockerized services.\nSkilled in JWT/OAuth2 authentication, Google Cloud Platform, CI/CD with GitHub Actions, and deployments on Linux\nservers with NGINX.\nPROFESSIONAL EXPERIENCE\nZYLIFE SMARTCARE PRIVATE LIMITED\nNEW DELHI, INDIA\nAssociate Software Developer\nMay 2024 – Present\n- Build and secure 300+ APIs using Firebase, JWT and OAuth, ensuring robust authentication.\n- Integrate third-party services like\n- ABHA (healthcare) APIs and\n- Google Maps APIs (Distance Matrix, Places) to enable healthcare and location-based features.\n- Triggering transaction and service based SMS .\n- Encryption using KMS services by Google Cloud\n- Manage Linux servers, configure Nginx for reverse proxy, and deploy with SSL.\n- Design scalable database schemas and optimize queries with aggregation pipelines.\n- Write unit tests using PyTest and implement caching with Redis.\n- Use Docker to containerize API projects for efficient deployment.\nZYLIFE SMARTCARE PRIVATE LIMITED\nNEW DELHI, INDIA\nFlutter Developer Intern\nFeb 2024 – May 2024\n- Spent the first 2 months learning Flutter and building responsive UI designs.\n- Transitioned to learning and developing RESTful APIs using Python and MongoDB.\n- Worked on creating FHIR-compliant web applications using HL7 standards.\nTECHNICAL SKILLS:\n- Programming Languages: Python, C, C++, Dart, HTML, CSS, JavaScript\n- Frameworks & Libraries: FastAPI, Flutter, BLoC, SQLAlchemy, Alembic, Pydantic, Requests, Bcrypt, Starlette\n- Databases: MongoDB, PostgreSQL, Firestore, SQLite, MySQL\n- Authentication & Security: JWT, OAuth2\n- DevOps & Deployment: Docker, GitHub Actions(CI/CD), Linux, NGINX, Gunicorn\n- Tools & Platforms: Git, Postman, Firebase, IDEs, Google Cloud Platform\n- Computer Science Fundamentals: Understanding of Data Structures, DBMS and OS\nPROJECTS:\nSOCIAL MEDIA BACKEND API\nTech Used: FastAPI, PostgreSQL, JWT, Docker, SQLAlchemy, Alembic, GitHub Actions, Pydantic, Pytest\n- Developed a fully functional REST API for a social media platform with features like user authentication, post\ncreation, and like/unlike actions.\n- Implemented CI/CD pipeline using GitHub Actions for automated testing and deployment.\nCROSS-PLATFORM NOTES APP\nTech Used: Flutter, Firebase Firestore, SQLite, BLoC\n- Developed a cross-platform notes app with cloud sync (Firestore) and offline access (SQLite). Used BLoC for state\nmanagement and custom theming for responsive UI.\nEDUCATION & OTHER\nRAJASTHAN TECHNICAL UNIVERSITY\n2020 – 2024\nB.Tech. Computer Science Engineering, CGPA 8.3\n"
}